terraform/aws/README.org
#+TITLE: Swarmer: Deploy on AWS
#+OPTIONS: toc:3
#+SETUPFILE: ../../theme.setup
 
Note: you may prefer reading the [[file:README.html][README.html]] file in your browser. 

* Description

This guide will help you deploy swarm on Amazon AWS.


* Pre-Requisites

To use this project you will need at least this list of tools properly installed on your box:

- docker 1.10
- gnu make 4.1
- vagrant 1.8
- virtualbox 5.0


** With docker [Recommanded]

You can then use the provided docker [[file:Dockerfile][container]] to avoid installing the entire toolbox on your computer by either using the image available on the docker hub or by building it yourself.


*** Use the image

 #+NAME: use the image
 #+BEGIN_SRC bash
$ docker run --rm -it yanndegat/swarmer
bash-4.3# ...
 #+END_SRC


*** Build the image

#+NAME: build the image
#+BEGIN_SRC bash
$ make latest
$ docker run --rm -it swarmer
bash-4.3# ...
#+END_SRC


** Without docker

If you chose not to use the docker image, you will have to install those additional tools :

- terraform 0.6.14
- packer 0.10.0
- python 2.7
- awscli (pip install awscli)
- gnupg 2.1
- jq 1.5
- curl


* Getting Started

Things should be a "little bit harder" than a single vagrant up ;)
Before booting the instances, we will have to create an ssh keypair and then install a brand new multi-az VPC, with its nat gateways and public and private subnets. We will also add a bastion+vpn instance to ease interactions with the services deployed within your VPC.

Then we can boot the Swarmer instances on the proper subnets.

We provide scripts to allow different kind of setups. Feel free to customize them to better suit your needs.

IMPORTANT: All of these actions will be performed by terraform. As your setup on AWS could be more than just a "dev environment", terraform store the state of our infrastructure in S3, allowing multiple users to retrieve/update the infrastructure.


** Init S3, Keypair and AMIs

A script is provided to initialize the creation of the required resources: 

- a s3 bucket
- a keypair
- the amis

The keypair will be encrypted with gpg and uploaded to the s3 bucket, so that it can be shared with other members of a team.

We will show an example using the docker swarmer image.

#+BEGIN_SRC bash
$ docker run --rm -it \ 
  -v $(pwd):/tmp/output \
  -e AWS_SECRET_ACCESS_KEY="[AWS_SECRET_ACCESS_KEY]" \
  -e AWS_ACCESS_KEY_ID="[AWS_ACCESS_KEY_ID]" \
  -e AWS_DEFAULT_REGION="[AWS_REGION]" \
  -e STACK_NAME="myswarmer" \
  -e AWS_ACCOUNT="[AWS_ACCOUNT]" \
  -e PASSPHRASE="[a passphrase]"
   swarmer terraform/aws/scripts/dc-init.sh -A init
...
1458667162,,ui,say,==> aws: No volumes to clean up%!(PACKER_COMMA) skipping
1458667162,,ui,say,==> aws: Deleting temporary security group...
1458667163,,ui,say,==> aws: Deleting temporary keypair...
1458667163,,ui,say,Build 'aws' finished.
1458667163,,ui,say,\n==> Builds finished. The artifacts of successful builds are:
1458667163,aws,artifact-count,1
1458667163,aws,artifact,0,builder-id,mitchellh.amazonebs
1458667163,aws,artifact,0,id,eu-west-1:ami-c79e1ab4
1458667163,aws,artifact,0,string,AMIs were created:\n\neu-west-1: ami-c79e1ab4
1458667163,aws,artifact,0,files-count,0
1458667163,aws,artifact,0,end
1458667163,,ui,say,--> aws: AMIs were created:\n\neu-west-1: ami-c79e1ab4
make: Leaving directory '/src/packer/swarmer'
#+END_SRC

IMPORTANT! As this step builds severals AMIs it can be pretty long. Coffee time.


** Create the VPC

A script is provided to create a VPC and all its associated resources.

#+BEGIN_SRC bash
$ docker run --rm -it \ 
  -e AWS_SECRET_ACCESS_KEY="[AWS_SECRET_ACCESS_KEY]" \
  -e AWS_ACCESS_KEY_ID="[AWS_ACCESS_KEY_ID]" \
  -e AWS_DEFAULT_REGION="[AWS_REGION]" \
  -e STACK_NAME="myswarmer" \
  -e AWS_ACCOUNT="[AWS_ACCOUNT]" \
   swarmer terraform/aws/scripts/dc-multi-az-vpc.sh bootstrap
...

Apply complete! Resources: 30 added, 0 changed, 0 destroyed.

The state of your infrastructure has been saved to the path
below. This state is required to modify and destroy your
infrastructure, so keep it safe. To inspect the complete state
use the `terraform show` command.

State path: .terraform/terraform.tfstate

Outputs:

  availability_zones        = eu-west-1a,eu-west-1b
  bastion_ip                = 53.40.250.156
  dns_domain_name           = myswarmer
  dns_zone_id               = Z31337FAKAECW63O
  key_name                  = myswarmer-keypair
  security_group            = sg-2c2d3048
  subnet_id_zone_a          = subnet-3f0ff45b
  subnet_id_zone_b          = subnet-ebfc1f9d
  subnet_ids                = subnet-3f0ff45b,subnet-ebfc1f9d
  swarmer_access_key_id     = FAKEI7WKFAKEIUIFAKE
  swarmer_access_key_secret = +FAK+FAKEFAKES75Eb5FAKE5LSZFAKE5nq1ypOGFAKE
  vpc_id                    = vpc-aa2e3ecf

$ ...
#+END_SRC

This step takes normally less than 5 minutes.


