terraform/aws/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-04-25 lun. 11:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Swarmer: Deploy on AWS</title>
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Swarmer: Deploy on AWS</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Description</a></li>
<li><a href="#orgheadline6">2. Pre-Requisites</a>
<ul>
<li><a href="#orgheadline4">2.1. With docker [Recommanded]</a>
<ul>
<li><a href="#orgheadline2">2.1.1. Use the image</a></li>
<li><a href="#orgheadline3">2.1.2. Build the image</a></li>
</ul>
</li>
<li><a href="#orgheadline5">2.2. Without docker</a></li>
</ul>
</li>
<li><a href="#orgheadline17">3. Getting Started</a>
<ul>
<li><a href="#orgheadline7">3.1. Init S3, Keypair and AMIs</a></li>
<li><a href="#orgheadline8">3.2. Create the VPC</a></li>
<li><a href="#orgheadline9">3.3. Create the Swarm!</a></li>
<li><a href="#orgheadline14">3.4. Configure your access to your swarm cluster</a>
<ul>
<li><a href="#orgheadline10">3.4.1. SSH tunnels</a></li>
<li><a href="#orgheadline11">3.4.2. VPN access</a></li>
<li><a href="#orgheadline12">3.4.3. SSH to a node</a></li>
<li><a href="#orgheadline13">3.4.4. Create an ssh tunnel to swarm</a></li>
</ul>
</li>
<li><a href="#orgheadline15">3.5. Destroy the cluster and the vpc</a></li>
<li><a href="#orgheadline16">3.6. Debugging</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Note: you may prefer reading the <a href="README.html">README.html</a> file in your browser. 
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Description</h2>
<div class="outline-text-2" id="text-1">
<p>
This guide will help you deploy swarm on Amazon AWS.
</p>
</div>
</div>


<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">2</span> Pre-Requisites</h2>
<div class="outline-text-2" id="text-2">
<p>
To use this project you will need at least this list of tools properly installed on your box:
</p>

<ul class="org-ul">
<li>docker 1.10</li>
<li>gnu make 4.1</li>
<li>vagrant 1.8</li>
<li>virtualbox 5.0</li>
</ul>
</div>


<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.1</span> With docker [Recommanded]</h3>
<div class="outline-text-3" id="text-2-1">
<p>
You can then use the provided docker <a href="Dockerfile">container</a> to avoid installing the entire toolbox on your computer by either using the image available on the docker hub or by building it yourself.
</p>
</div>


<div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><span class="section-number-4">2.1.1</span> Use the image</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">

<pre class="src src-bash" id="orgsrcblock1">$ docker run --rm -it yanndegat/swarmer
bash-4.3# ...
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><span class="section-number-4">2.1.2</span> Build the image</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">

<pre class="src src-bash" id="orgsrcblock2">$ make latest
$ docker run --rm -it swarmer
bash-4.3# ...
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">2.2</span> Without docker</h3>
<div class="outline-text-3" id="text-2-2">
<p>
If you chose not to use the docker image, you will have to install those additional tools :
</p>

<ul class="org-ul">
<li>terraform 0.6.14</li>
<li>packer 0.10.0</li>
<li>python 2.7</li>
<li>awscli (pip install awscli)</li>
<li>gnupg 2.1</li>
<li>jq 1.5</li>
<li>curl</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgheadline17" class="outline-2">
<h2 id="orgheadline17"><span class="section-number-2">3</span> Getting Started</h2>
<div class="outline-text-2" id="text-3">
<p>
Things should be a "little bit harder" than a single vagrant up ;)
Before booting the instances, we will have to create an ssh keypair and then install a brand new multi-az VPC, with its nat gateways and public and private subnets. We will also add a bastion+vpn instance to ease interactions with the services deployed within your VPC.
</p>

<p>
Then we can boot the Swarmer instances on the proper subnets.
</p>

<p>
We provide scripts to allow different kind of setups. Feel free to customize them to better suit your needs.
</p>

<p>
IMPORTANT: All of these actions will be performed by terraform. As your setup on AWS could be more than just a "dev environment", terraform store the state of our infrastructure in S3, allowing multiple users to retrieve/update the infrastructure.
</p>
</div>


<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">3.1</span> Init S3, Keypair and AMIs</h3>
<div class="outline-text-3" id="text-3-1">
<p>
A script is provided to initialize the creation of the required resources: 
</p>

<ul class="org-ul">
<li>a s3 bucket</li>
<li>a keypair</li>
<li>the amis</li>
</ul>

<p>
The keypair will be encrypted with gpg and uploaded to the s3 bucket, so that it can be shared with other members of a team.
</p>

<p>
We will show an example using the docker swarmer image.
</p>

<div class="org-src-container">

<pre class="src src-bash">$ docker run --rm -it \ 
  -v $(pwd):/tmp/output \
  -e AWS_SECRET_ACCESS_KEY="[AWS_SECRET_ACCESS_KEY]" \
  -e AWS_ACCESS_KEY_ID="[AWS_ACCESS_KEY_ID]" \
  -e AWS_DEFAULT_REGION="[AWS_REGION]" \
  -e STACK_NAME="myswarmer" \
  -e AWS_ACCOUNT="[AWS_ACCOUNT]" \
  -e PASSPHRASE="[a passphrase]"
   swarmer terraform/aws/scripts/dc-init.sh -A init
...
1458667162,,ui,say,==&gt; aws: No volumes to clean up%!(PACKER_COMMA) skipping
1458667162,,ui,say,==&gt; aws: Deleting temporary security group...
1458667163,,ui,say,==&gt; aws: Deleting temporary keypair...
1458667163,,ui,say,Build 'aws' finished.
1458667163,,ui,say,\n==&gt; Builds finished. The artifacts of successful builds are:
1458667163,aws,artifact-count,1
1458667163,aws,artifact,0,builder-id,mitchellh.amazonebs
1458667163,aws,artifact,0,id,eu-west-1:ami-c79e1ab4
1458667163,aws,artifact,0,string,AMIs were created:\n\neu-west-1: ami-c79e1ab4
1458667163,aws,artifact,0,files-count,0
1458667163,aws,artifact,0,end
1458667163,,ui,say,--&gt; aws: AMIs were created:\n\neu-west-1: ami-c79e1ab4
make: Leaving directory '/src/packer/swarmer'
</pre>
</div>

<p>
IMPORTANT! As this step builds severals AMIs it can be pretty long. Coffee time.
</p>
</div>
</div>


<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">3.2</span> Create the VPC</h3>
<div class="outline-text-3" id="text-3-2">
<p>
A script is provided to create a VPC and all its associated resources.
</p>

<div class="org-src-container">

<pre class="src src-bash">$ docker run --rm -it \ 
  -e AWS_SECRET_ACCESS_KEY="[AWS_SECRET_ACCESS_KEY]" \
  -e AWS_ACCESS_KEY_ID="[AWS_ACCESS_KEY_ID]" \
  -e AWS_DEFAULT_REGION="[AWS_REGION]" \
  -e STACK_NAME="myswarmer" \
  -e AWS_ACCOUNT="[AWS_ACCOUNT]" \
   swarmer terraform/aws/scripts/dc-multi-az-vpc.sh bootstrap
...

Apply complete! Resources: 30 added, 0 changed, 0 destroyed.

The state of your infrastructure has been saved to the path
below. This state is required to modify and destroy your
infrastructure, so keep it safe. To inspect the complete state
use the `terraform show` command.

State path: .terraform/terraform.tfstate

Outputs:

  availability_zones        = eu-west-1a,eu-west-1b
  bastion_ip                = 53.40.250.156
  dns_domain_name           = myswarmer
  dns_zone_id               = Z31337FAKAECW63O
  key_name                  = myswarmer-keypair
  security_group            = sg-2c2d3048
  subnet_id_zone_a          = subnet-3f0ff45b
  subnet_id_zone_b          = subnet-ebfc1f9d
  subnet_ids                = subnet-3f0ff45b,subnet-ebfc1f9d
  swarmer_access_key_id     = FAKEI7WKFAKEIUIFAKE
  swarmer_access_key_secret = +FAK+FAKEFAKES75Eb5FAKE5LSZFAKE5nq1ypOGFAKE
  vpc_id                    = vpc-aa2e3ecf

$ ...
</pre>
</div>

<p>
This step takes normally less than 5 minutes.
</p>
</div>
</div>
