terraform/aws/README.org
** Create the Swarm!

Now that you have a proper VPC bootstrapped, you can deploy your swarm instance into it. 

You have several choices of deployment :

- separated consul servers from swarm nodes
- separated swarm managers from swarm nodes
- single/multi availability zones deployment

It is commonly accepted that, for small clusters (up to 10 nodes), you can colocate your swarm managers with your swarm agents and have as many managers as agents.
Yet, it is not recommanded to have a lot of consul servers. From 3 to 6 is a good choice for reliability. More and the gossip protocol and sync process will start downgrading performances.

Here we will boot a 6 nodes swarm clusters spanned on 2 availability zones, with one consul server by swarm node. That way, if an avaibility zone goes down, consul still has 3 nodes to make a quorum for master election.

Terraform is the tool used to bootstrap the instance. Also several building blocks are available to help you quickly bootstrap a cluster. Some example bash scripts demonstrate how to use those terraform building blocks. Feel free to add/create/modify them to get the infrastructure that better suits your requirements.

#+BEGIN_SRC bash
$ docker run --rm -it \ 
  -e AWS_SECRET_ACCESS_KEY="[AWS_SECRET_ACCESS_KEY]" \
  -e AWS_ACCESS_KEY_ID="[AWS_ACCESS_KEY_ID]" \
  -e AWS_DEFAULT_REGION="[AWS_REGION]" \
  -e STACK_NAME="myswarmer" \
  -e AWS_ACCOUNT="[AWS_ACCOUNT]" \
   swarmer terraform/aws/scripts/dc-multi-az-simple-swarm.sh bootstrap
...

Apply complete! Resources: 6 added, 0 changed, 0 destroyed.

The state of your infrastructure has been saved to the path
below. This state is required to modify and destroy your
infrastructure, so keep it safe. To inspect the complete state
use the `terraform show` command.

State path: .terraform/terraform.tfstate

$ ...
#+END_SRC


** Configure your access to your swarm cluster

Your cluster is located on a private subnet with no public facing IP. To be able to target it or simply connect to it, you have two options:

- through ssh tunnels
- through the VPN


*** SSH tunnels

This section describes how to establish ssh connections or tunnels through the bastion instance of the VPC. As it can be quite an annoying step, we've made a simple script which generates an ssh config and download the private key that you'll have to copy in your local ssh directory ( probably ~/.ssh ).

 #+BEGIN_SRC bash
$ docker run --rm -it \ 
   -e AWS_SECRET_ACCESS_KEY="[AWS_SECRET_ACCESS_KEY]" \
   -e AWS_ACCESS_KEY_ID="[AWS_ACCESS_KEY_ID]" \
   -e AWS_DEFAULT_REGION="[AWS_REGION]" \
   -e STACK_NAME="myswarmer" \
   -e AWS_ACCOUNT="[AWS_ACCOUNT]" \
   -e PASSPHRASE="[a passphrase]" \
   -v /tmp:/output
    swarmer terraform/aws/scripts/dc-multi-az-simple-swarm.sh config-ssh 
 ...
$ cat /tmp/config >> ~/.ssh/config
 #the docker container generates files that belong to the root user
$ sudo cp /tmp/myswarmer.key ~/.ssh
$ sudo chown $USER ~/.ssh/myswarmer.key
$ cat ~/.ssh/config
 ...
 Host myswarmer-swarm-zone-a-swarm_manager-0
    HostName 10.233.1.205
    IdentityFile ~/.ssh/myswarmer.key
    ProxyCommand ssh -l ec2-user -i ~/.ssh/myswarmer.key -oStrictHostKeyChecking=no -oUserKnownHostsFile=/dev/null "52.48.24.59" nc %h %p

 Host myswarmer-swarm-zone-a-swarm_manager-1
    HostName 10.233.1.254
    IdentityFile ~/.ssh/myswarmer.key
    ProxyCommand ssh -l ec2-user -i ~/.ssh/myswarmer.key -oStrictHostKeyChecking=no -oUserKnownHostsFile=/dev/null "52.48.24.59" nc %h %p

 Host myswarmer-swarm-zone-a-swarm_manager-2
    HostName 10.233.1.253
    IdentityFile ~/.ssh/myswarmer.key
    ProxyCommand ssh -l ec2-user -i ~/.ssh/myswarmer.key -oStrictHostKeyChecking=no -oUserKnownHostsFile=/dev/null "52.48.24.59" nc %h %p

 Host myswarmer-swarm-zone-b-swarm_manager-0
    HostName 10.233.3.8
    IdentityFile ~/.ssh/myswarmer.key
    ProxyCommand ssh -l ec2-user -i ~/.ssh/myswarmer.key -oStrictHostKeyChecking=no -oUserKnownHostsFile=/dev/null "52.48.24.59" nc %h %p

 Host myswarmer-swarm-zone-b-swarm_manager-1
    HostName 10.233.3.54
    IdentityFile ~/.ssh/myswarmer.key
    ProxyCommand ssh -l ec2-user -i ~/.ssh/myswarmer.key -oStrictHostKeyChecking=no -oUserKnownHostsFile=/dev/null "52.48.24.59" nc %h %p

 Host myswarmer-swarm-zone-b-swarm_manager-2
    HostName 10.233.3.45
    IdentityFile ~/.ssh/myswarmer.key
    ProxyCommand ssh -l ec2-user -i ~/.ssh/myswarmer.key -oStrictHostKeyChecking=no -oUserKnownHostsFile=/dev/null "52.48.24.59" nc %h %p

 Host "10.233.*"
    IdentityFile ~/.ssh/myswarmer.key
    ProxyCommand ssh -l ec2-user -i ~/.ssh/myswarmer.key -oStrictHostKeyChecking=no -oUserKnownHostsFile=/dev/null "52.48.24.59" nc %h %p

$ ...
 #+END_SRC

 You will notice that there is one entry per host, plus one global entry matching every ip beginning with 10.233.*. This uncommon /16 subnet has been chosen to avoid IP overlapping with your privates subnets. It can be configured if it doesn't suits you. See [[file:terraform/aws/vpc/variables.tf]]. 

 IMPORTANT! Only the hosts that are "up" are added to the config. By "up", we mean that they have at least joined the consul cluster. If you have no host in the config, retrieve the privates ips of your instances through the aws console and ssh into them using their private IP; the global "10.233.*" is dedicated to this.

 You'll also notice that each entry refers to a "myswarmer.key". This is the private ssh key that has been generated during the init phase and uploaded to s3.


