terraform/aws/README.org
*** VPN access

This section describes how to establish a vpn connection with openvpn. You need to have a proper install of openvpn on your box. You also need the private ssh key. Refer to the previous section to know how to retrieve it.

The first thing you need is to generate your VPN keys and retrieve the openvpn configuration.

#+BEGIN_SRC bash
$ # the ip of the bastion is referred in the generated ssh config, and also 
$ ssh myswarmer-bastion /opt/ovpn-client-config.sh MYNAME > ~/MYNAME.myswarmer-ovpn.conf
Generating a 2048 bit RSA private key
..........................+++
................+++
writing new private key to '/etc/openvpn/pki/private/MYNAME.key.XXXXigMGgg'
-----
Using configuration from /usr/share/easy-rsa/openssl-1.0.cnf
Check that the request matches the signature
Signature ok
The Subject's Distinguished Name is as follows
commonName            :ASN.1 12:'MYNAME'
Certificate is to be certified until Apr  6 15:59:42 2026 GMT (3650 days)

Write out database with 1 new entries
Data Base Updated

$ sudo openvpn ~/MYNAME.myswarmer-ovpn.conf
...
Fri Apr  8 17:58:48 2016 TLS Error: TLS handshake failed
Fri Apr  8 17:58:48 2016 SIGUSR1[soft,tls-error] received, process restarting
Fri Apr  8 17:58:50 2016 WARNING: Your certificate is not yet valid!
Fri Apr  8 17:58:50 2016 Control Channel Authentication: tls-auth using INLINE static key file
Fri Apr  8 17:58:50 2016 UDPv4 link local: [undef]
Fri Apr  8 17:58:50 2016 UDPv4 link remote: [AF_INET]52.48.31.60:1194
Fri Apr  8 17:58:50 2016 [52.48.31.60] Peer Connection Initiated with [AF_INET]52.48.31.60:1194
Fri Apr  8 17:58:52 2016 TUN/TAP device tun0 opened
Fri Apr  8 17:58:52 2016 do_ifconfig, tt->ipv6=0, tt->did_ifconfig_ipv6_setup=0
Fri Apr  8 17:58:52 2016 /usr/bin/ip link set dev tun0 up mtu 1500
Fri Apr  8 17:58:52 2016 /usr/bin/ip addr add dev tun0 local 192.168.255.6 peer 192.168.255.5
Fri Apr  8 17:58:52 2016 Initialization Sequence Completed

$ # get the internal ip of one of the members of the cluster and try to get consul info:

$ curl 10.233.1.145:8500/v1/catalog
{"consul":[],"swarm-4000":[]}%
$ # BINGO!
#+END_SRC


*** SSH to a node

You can ssh to a swarm with a simple ssh command:

#+BEGIN_SRC bash
$ ssh core@myswarmer-swarm-zone-a-swarm_manager-0
CoreOS alpha (991.0.0)
core@ip-172-233-3-45 ~ $ 
core@ip-172-233-3-45 ~ $ docker ps
CONTAINER ID        IMAGE                           COMMAND                  CREATED             STATUS              PORTS                                   NAMES
f08eb5612b51        gliderlabs/registrator:latest   "/bin/registrator -in"   27 minutes ago      Up 27 minutes                                               registrator
666dcc033b8f        swarm:latest                    "/swarm manage -H :40"   27 minutes ago      Up 27 minutes       2375/tcp, 172.233.3.45:4000->4000/tcp   swarm-manager
14dc3ed89cb6        swarm:latest                    "/swarm join --advert"   27 minutes ago      Up 27 minutes       2375/tcp                                swarm-agent

core@ip-172-233-3-45 ~ $ ...
#+END_SRC


*** Create an ssh tunnel to swarm 

If you don't want to use the VPN, you can create an ssh tunnel to ease the deployment of a container from your box

#+BEGIN_SRC bash
# you have to replace the 172.233.1.205 ip with the private ip of the node you selected
$ ssh -fqnNT -L localhost:4000:172.233.1.205:4000 core@myswarmer-swarm-zone-a-swarm_manager-0

$ export DOCKER_HOST=localhost:4000
$ docker info
Containers: 18
 Running: 18
 Paused: 0
 Stopped: 0
Images: 18
Server Version: swarm/1.1.3
Role: replica
Primary: 172.233.3.8:4000
Strategy: spread
Filters: health, port, dependency, affinity, constraint
Nodes: 6
 ip-172-233-1-205.eu-west-1.compute.internal: 172.233.1.205:2375
  └ Status: Healthy
  └ Containers: 3
  └ Reserved CPUs: 0 / 2
  └ Reserved Memory: 0 B / 8.19 GiB
  └ Labels: executiondriver=native-0.2, kernelversion=4.4.6-coreos, operatingsystem=CoreOS 991.0.0 (Coeur Rouge), storagedriver=overlay
  └ Error: (none)
  └ UpdatedAt: 2016-03-24T10:57:49Z
 ip-172-233-1-253.eu-west-1.compute.internal: 172.233.1.253:2375
  └ Status: Healthy
  └ Containers: 3
  └ Reserved CPUs: 0 / 2
  └ Reserved Memory: 0 B / 8.19 GiB
  └ Labels: executiondriver=native-0.2, kernelversion=4.4.6-coreos, operatingsystem=CoreOS 991.0.0 (Coeur Rouge), storagedriver=overlay
  └ Error: (none)
  └ UpdatedAt: 2016-03-24T10:57:37Z
 ip-172-233-1-254.eu-west-1.compute.internal: 172.233.1.254:2375
  └ Status: Healthy
  └ Containers: 3
  └ Reserved CPUs: 0 / 2
  └ Reserved Memory: 0 B / 8.19 GiB
  └ Labels: executiondriver=native-0.2, kernelversion=4.4.6-coreos, operatingsystem=CoreOS 991.0.0 (Coeur Rouge), storagedriver=overlay
  └ Error: (none)
  └ UpdatedAt: 2016-03-24T10:57:45Z
 ip-172-233-3-8.eu-west-1.compute.internal: 172.233.3.8:2375
  └ Status: Healthy
  └ Containers: 3
  └ Reserved CPUs: 0 / 2
  └ Reserved Memory: 0 B / 8.19 GiB
  └ Labels: executiondriver=native-0.2, kernelversion=4.4.6-coreos, operatingsystem=CoreOS 991.0.0 (Coeur Rouge), storagedriver=overlay
  └ Error: (none)
  └ UpdatedAt: 2016-03-24T10:57:43Z
 ip-172-233-3-45.eu-west-1.compute.internal: 172.233.3.45:2375
  └ Status: Healthy
  └ Containers: 3
  └ Reserved CPUs: 0 / 2
  └ Reserved Memory: 0 B / 8.19 GiB
  └ Labels: executiondriver=native-0.2, kernelversion=4.4.6-coreos, operatingsystem=CoreOS 991.0.0 (Coeur Rouge), storagedriver=overlay
  └ Error: (none)
  └ UpdatedAt: 2016-03-24T10:57:26Z
 ip-172-233-3-54.eu-west-1.compute.internal: 172.233.3.54:2375
  └ Status: Healthy
  └ Containers: 3
  └ Reserved CPUs: 0 / 2
  └ Reserved Memory: 0 B / 8.19 GiB
  └ Labels: executiondriver=native-0.2, kernelversion=4.4.6-coreos, operatingsystem=CoreOS 991.0.0 (Coeur Rouge), storagedriver=overlay
  └ Error: (none)
  └ UpdatedAt: 2016-03-24T10:57:42Z
Plugins:
 Volume:
 Network:
Kernel Version: 4.4.6-coreos
Operating System: linux
Architecture: amd64
CPUs: 12
Total Memory: 49.14 GiB
Name: a540944837d6

$ ...
#+END_SRC


** Destroy the cluster and the vpc

You can destroy the resources with the same scripts used to terraform by simply replacing the "bootstrap" command with "destroy"

** Debugging

The best way to debug the system is to run the docker tool container with the proper env vars set, and attached to your src volume. You still have to get familiar with terraform, which is not the purpose of this guide.

#+BEGIN_SRC bash
$ docker run --rm -it \ 
  -v $(pwd):/src
  -e AWS_SECRET_ACCESS_KEY="[AWS_SECRET_ACCESS_KEY]" \
  -e AWS_ACCESS_KEY_ID="[AWS_ACCESS_KEY_ID]" \
  -e AWS_DEFAULT_REGION="[AWS_REGION]" \
  -e STACK_NAME="myswarmer" \
  -e AWS_ACCOUNT="[AWS_ACCOUNT]" \
   swarmer 
bash-4.3# ...
#+END_SRC
